# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+TITLE:     Data Management: Tips and Tools
#+Author: Arnaud Legrand\medskip\newline\logoInstitutions
#+DATE:  \vspace{3cm}\JDEVlogo SMPE lecture\newline October 2022\newline\begin{overlayarea}{1.05\linewidth}{0cm}\vspace{-3.2cm}\hfill{\mylogo}\end{overlayarea}\vspace{-1.0cm}
#+LANGUAGE: en
#+STARTUP: beamer indent inlineimages logdrawer
#+TAGS: noexport(n)

#+PROPERTY: header-args  :session :eval never-export :exports both
#+DRAWERS: latex_headers

:latex_headers:
#+LaTeX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt,presentation,xcolor={usenames,dvipsnames,svgnames,table}]
# # aspectratio=169
#+OPTIONS:   H:2 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_COMPILER: lualatex -shell-escape
#+LATEX_HEADER: \usedescriptionitemofwidthas{bl}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{figlatex}
#+LATEX_HEADER: \usepackage[french]{babel}
#+LATEX_HEADER: %\usepackage{DejaVuSansMono}
#+LATEX_HEADER: \usepackage{ifthen,amsmath,amstext,gensymb,amssymb}
#+LATEX_HEADER: \usepackage{relsize}
#+LATEX_HEADER: \usepackage{boxedminipage,xspace,multicol}
#+LATEX_HEADER: %%%%%%%%% Begin of Beamer Layout %%%%%%%%%%%%%
#+LATEX_HEADER: \ProcessOptionsBeamer
#+LATEX_HEADER: \usetheme[numbering=fraction,titleformat=smallcaps,progressbar=frametitle]{metropolis}
#+LATEX_HEADER: \usepackage{fontawesome}
#+LATEX_HEADER: \usecolortheme[named=BrickRed]{structure}
#+LATEX_HEADER: %%%%%%%%% End of Beamer Layout %%%%%%%%%%%%%
#+LATEX_HEADER: \usepackage{array}
#+LATEX_HEADER: \newcolumntype{L}[1]{>{\raggedright\let\newline\\\arraybackslash\hspace{0pt}}m{#1}}
#+LATEX_HEADER: \newcolumntype{C}[1]{>{\centering\let\newline\\\arraybackslash\hspace{0pt}}m{#1}}
#+LATEX_HEADER: \newcolumntype{R}[1]{>{\raggedleft\let\newline\\\arraybackslash\hspace{0pt}}m{#1}}

#+LATEX_HEADER: \usepackage{verbments}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{color}
** Fake but Awesome file names                                :noexport:
#+begin_src shell :results output :exports both
cd /tmp/
mkdir -p awesome_names/data
cd awesome_names
for i in data/2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_A01.csv \
     data/2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_A02.csv \
     data/2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_B01.csv \
     data/2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_B02.csv \
     01_marshal-data.R \
     02_pre-dea-filtering.R \
     03_dea-wit-limma-voom.R \
     04_explore-dea-results.R \
     Makefile \
     README \
     LICENCE \
     helper01_load-counts.R \
     helper01_load-exp-des.R \
  ; do touch $i ; done
ls -RC
#+end_src

#+RESULTS:
#+begin_example
01_marshal-data.R         data/                    Makefile
02_pre-dea-filtering.R    helper01_load-counts.R   README
03_dea-wit-limma-voom.R   helper01_load-exp-des.R
04_explore-dea-results.R  LICENCE

./data:
2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_A01.csv
2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_A02.csv
2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_A03.csv
2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_B01.csv
2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_B02.csv
2013-06-26_BRAWNFTEGASSAY_Plasmid-Celline-100-1MutantFraction_B03.csv
#+end_example

** Demo: Initialization
# - Sources d'inspiration possibles: 
#   - https://git-memo.readthedocs.io/en/latest/annex.html
#   - https://git-annex.branchable.com/walkthrough/

#+begin_src shell :session *shell* :results none :exports none
rm -rf /tmp/test-git-annex
mkdir /tmp/test-git-annex
cd /tmp/test-git-annex
mkdir /tmp/test-git-annex/.git
echo "[user]
        name = Arnaud Legrand
        email = arnaud.legrand@imag.fr

[color]
    ui = false
    branch = false
    diff = false
    interactive = false
    status = false
    log = false
    init = false
" > .git/config
     git config --global color.ui false
     git config --global advice.ignoredHook false
     export TERM="xterm" # for git branch... :(
#+end_src

#+begin_src shell :session *shell* :results output :exports both
pwd
git init
echo "Hello" > README
git add README ; git commit -m "Initial commit"
git branch
git annex init "My laptop"
git branch
#+end_src

#+RESULTS:
#+begin_example
/tmp/test-git-annex
Initialized empty Git repository in /tmp/test-git-annex/.git/
icarus:/tmp/test-git-annex$ [master (root-commit) 7f50a1f] Initial commit
 1 file changed, 1 insertion(+)
 create mode 100644 README
,* master
init My laptop ok
(recording state in git...)
git-annex
,* master
#+end_example
** Demo: Adding data
#+begin_src shell :session *shell* :results output :exports both
mkdir -p data/
git config annex.largefiles 'largerthan=100kb and include=data/*'
#+end_src

#+RESULTS:

#+begin_src shell :session *shell* :results output :exports both
echo "random; stuff" > data/foo.csv
dd if=/dev/zero of=data/zero.dat bs=1M count=1
ls -l data/
git annex add data/* ## should be git add !!
ls -l data/
git commit -m "Adding data files"
#+end_src

#+RESULTS:
#+begin_example
1048576 bytes (1.0 MB, 1.0 MiB) copied, 0.00545621 s, 192 MB/s
-rw-r--r-- 1 alegrand alegrand      14 Oct 26 23:15 foo.csv
-rw-r--r-- 1 alegrand alegrand 1048576 Oct 26 23:15 zero.dat
add data/foo.csv (non-large file; adding content to git repository) ok
add data/zero.dat ok
(recording state in git...)
-rw-r--r-- 1 alegrand alegrand  14 Oct 26 23:15 foo.csv
../.git/annex/objects/fP/jz/SHA256E-s1048576--30e14955ebf1352266dc2ff8067e68104607e750abb9d3b36582b8af909fcb58.dat/SHA256E-s1048576--30e14955ebf1352266dc2ff8067e68104607e750abb9d3b36582b8af909fcb58.dat
[master 91c2449] Adding data files
 2 files changed, 2 insertions(+)
 create mode 100644 data/foo.csv
 create mode 120000 data/zero.dat
#+end_example
** Demo: Adding a remote on a USB key (1/2)
#+begin_src shell :session *shell* :results none :exports both
rm -rf /media/alegrand/7C78-3F81/test-git-annex
#+end_src

#+begin_src shell :session *shell* :results output :exports both
cd /media/alegrand/7C78-3F81
git clone /tmp/test-git-annex
ls -lR test-git-annex/
#+end_src

#+RESULTS:
#+begin_example

Cloning into 'test-git-annex'...
done.
test-git-annex/:
total 8
drwxr-xr-x 2 alegrand alegrand 4096 Oct 26 23:16 data
-rw-r--r-- 1 alegrand alegrand    6 Oct 26 23:16 README

test-git-annex/data:
total 8
-rw-r--r-- 1 alegrand alegrand  14 Oct 26 23:16 foo.csv
-rw-r--r-- 1 alegrand alegrand 201 Oct 26 23:16 zero.dat
#+end_example
** Demo: Adding a remote on a USB key (2/2)
Let's initialize the USB key and tell it about the laptop
#+begin_src shell :session *shell* :results output :exports both
cd test-git-annex
git annex init "portable USB drive"
git remote add laptop /tmp/test-git-annex
#+end_src

#+RESULTS:
#+begin_example
init portable USB drive 
  Detected a filesystem without fifo support.
  Disabling ssh connection caching.
  Detected a crippled filesystem.
  Entering an adjusted branch where files are unlocked as this filesystem does not support locked files.
Switched to branch 'adjusted/master(unlocked)'
ok
(recording state in git...)
#+end_example

Let's tell the laptop about the USB key
#+begin_src shell :session *shell* :results output :exports both
cd /tmp/test-git-annex
git remote add usbdrive /media/alegrand/7C78-3F81/test-git-annex
#+end_src

#+RESULTS:

** Demo: Syncing the annexes (not the content!)
#+begin_src shell :session *shell* :results output :exports both
cd /media/alegrand/7C78-3F81/test-git-annex
git annex sync laptop
#+end_src

#+RESULTS:
#+begin_example

commit 
On branch adjusted/master(unlocked)
nothing to commit, working tree clean
ok
pull laptop 
From /tmp/test-git-annex
laptop/git-annex
laptop/master
ok
push laptop 
Enumerating objects: 5, done.
Delta compression using up to 4 threads
Total 3 (delta 0), reused 0 (delta 0), pack-reused 0
To /tmp/test-git-annex
synced/master
synced/git-annex
ok
#+end_example

** Demo: Dropping files
Let's try to get rid of the big file on my laptop
#+begin_src shell :session *shell* :results output :exports both
cd /tmp/test-git-annex
git annex drop data/zero.dat
#+end_src

#+RESULTS:
: drop data/zero.dat (unsafe) 
:   Could only verify the existence of 0 out of 1 necessary copy
:   Rather than dropping this file, try using: git annex move
:   (Use --force to override this check, or adjust numcopies.)
: failed
: drop: 1 failed
** Demo: Dropping files (2/2)
#+begin_src shell :session *shell* :results output :exports both
git annex sync
git annex drop data/zero.dat
#+end_src

#+RESULTS:
: commit 
: On branch master
: nothing to commit, working tree clean
: ok
: pull usbdrive 
: remote: Enumerating objects: 16, done.
: remote: Counting objects: 100% (16/16), done.
: remote: Compressing objects: 100% (8/8), done.
: remote: Total 9 (delta 1), reused 0 (delta 0), pack-reused 0
: Unpacking objects: 100% (9/9), 852 bytes | 106.00 KiB/s, done.
: From /media/alegrand/7C78-3F81/test-git-annex
:  * [new branch]      adjusted/master(unlocked) -> usbdrive/adjusted/master(unlocked)
:  * [new branch]      git-annex                 -> usbdrive/git-annex
:  * [new branch]      master                    -> usbdrive/master
:  * [new branch]      synced/master             -> usbdrive/synced/master
: ok
: (merging usbdrive/git-annex into git-annex...)
: drop data/zero.dat ok
# : (recording state in git...)

\vspace{-1em}Using =git annex move --to usbdrive= in the first place would have been
more convenient.
** Demo: Getting files back (2/2)
#+begin_src shell :session *shell* :results output :exports both
git annex get data/zero.dat
#+end_src

#+RESULTS:
: get data/zero.dat (from usbdrive...) 
: ok
: (recording state in git...)

** Large files cannot be modified inadvertently
#+begin_src shell :session *shell* :results output :exports both
dd if=/dev/zero of=data/zero.dat bs=2M count=1
#+end_src

#+RESULTS:
: dd: failed to open 'data/zero.dat': Permission denied

You should =git annex unlock= them first.

#+begin_src shell :session *shell* :results output :exports both
dd if=/dev/zero of=data/zero2.dat bs=2M count=1
git annex add data/zero2.dat
git annex move data/zero2.dat --to usbdrive
#+end_src

#+RESULTS:
: 1+0 records in
: 1+0 records out
: 2097152 bytes (2.1 MB, 2.0 MiB) copied, 0.0106413 s, 197 MB/s
: add data/zero2.dat
: 31.98 KiB        14 MiB/s 0s100%  2 MiB           110 MiB/s 0s                                  ok
: (recording state in git...)
: move data/zero2.dat (to usbdrive...) 
: ok
: (recording state in git...)
** There is more!
#+begin_src shell :session *shell* :results output :exports both
cd data/
git annex addurl --preserve-filename --pathdepth=2 \ 
    https://www.sidc.be/DATA/uset/Wlight/2014/06/UPH20140601105039.FTS 
#+end_src

#+RESULTS:
: addurl https://www.sidc.be/DATA/uset/Wlight/2014/06/UPH20140601105039.FTS
: (to uset/Wlight/2014/06/UPH20140601105039.FTS) ok
: (recording state in git...)

=git-annex= can also store files in Amazon S3, Glacier, on a rsync
server, in WebDAV, or even pull files down from the web and
bittorrent. 

Bonus: Files stored on special remotes can easily be *encrypted*!
** WIP slides

#+begin_src shell :results output raw :exports results
for i in `find ../../RR_MOOC/gitlab-inria/mooc-rr2-ressources/docs/module2/ -name 'slides.pdf' | sort`; do
    j=`echo $i | sed -e 's/^.*module2\///g' -e 's/\//~/g'`
    echo $i | sed -e 's/^/- [[file:/' -e "s/$/][$j]]/"
done
#+end_src

#+RESULTS:
- [[file:../../RR_MOOC/gitlab-inria/mooc-rr2-ressources/docs/module2/seq1-sw_env_intro/unit1-lecture/slides.pdf][seq1-sw_env_intro~unit1-lecture~slides.pdf]]
- [[file:../../RR_MOOC/gitlab-inria/mooc-rr2-ressources/docs/module2/seq2-package_mgmt/unit1-lecture/slides.pdf][seq2-package_mgmt~unit1-lecture~slides.pdf]]
- [[file:../../RR_MOOC/gitlab-inria/mooc-rr2-ressources/docs/module2/seq3-isolation_and_containers/unit1-lecture/slides.pdf][seq3-isolation_and_containers~unit1-lecture~slides.pdf]]
- [[file:../../RR_MOOC/gitlab-inria/mooc-rr2-ressources/docs/module2/seq3-isolation_and_containers/unit2-lecture/slides.pdf][seq3-isolation_and_containers~unit2-lecture~slides.pdf]]

